# Intro to Tidyverse

In [3]:
library(tidyverse)
cetaceans <- read_csv('allCetaceanData.csv')

Registered S3 method overwritten by 'rvest':
  method            from
  read_xml.response xml2
-- Attaching packages --------------------------------------- tidyverse 1.2.1 --
v ggplot2 3.2.0     v purrr   0.3.2
v tibble  2.1.1     v dplyr   0.8.3
v tidyr   0.8.3     v stringr 1.4.0
v readr   1.3.1     v forcats 0.4.0
Warning message:
"package 'dplyr' was built under R version 3.6.1"-- Conflicts ------------------------------------------ tidyverse_conflicts() --
x dplyr::filter() masks stats::filter()
x dplyr::lag()    masks stats::lag()
Warning message:
"Missing column names filled in: 'X1' [1]"Parsed with column specification:
cols(
  .default = col_character(),
  X1 = col_double(),
  originDate = col_date(format = ""),
  statusDate = col_date(format = ""),
  transferDate = col_date(format = ""),
  entryDate = col_date(format = "")
)
See spec(...) for full column specifications.

In [5]:
class(cetaceans)
cetaceans %>%  head()

[1] "spec_tbl_df" "tbl_df"      "tbl"         "data.frame"

  X1 species
1 1  Bottlenose
2 2  Bottlenose
3 3  Bottlenose
4 4  Bottlenose
5 5  Bottlenose
6 6  Bottlenose
  id                                                                   name
1 NOA0004614, AZA 428, MLF-428                                         Dazzle
2 NOA0004386, AZA 138, IDR-73-1                                        Tursi
3 NOA0002137, SWC-TTG-7816                                             Starbuck
4 NOA0002690, SWF-TT-7903                                              Sandy
5 NOA0004418, AZA 242, SWF-TT-7904, MH-82-36-TT (New England Aquarium) Sandy
6 NOA0002725, SWC-TT-8014                                              Nacha
  sex accuracy birthYear acquisition originDate originLocation          ...
1 F   a        1989      Born        1989-04-07 Marineland Florida      ...
2 F   a        1973      Born        1973-11-26 Dolphin Research Center ...
3 M   a        1978      Born        1978-05-13 SeaWorld San Diego      ...
4 F   a        1979      Born        1979-02-03 SeaWorld Orlando        ...
5 M   a        1979      Born        1979-08-15 SeaWorld Orlando        ...
6 F   a        1980      Born        1980-10-10 SeaWorld San Diego      ...
  transfers
1 NA
2 NA
3 SeaWorld San Diego to SeaWorld Aurora (??-???-1983) to SeaWorld San Diego (??-???-1983) to SeaWorld Aurora (??-???-1985) to SeaWorld San Diego (??-???-1985) to SeaWorld Orlando (< Nov 1987) to SeaWorld San Antonio (< 1991) to Busch Gardens Tampa (1991 / 1992) to National Aquarium in Baltimore (11-Oct-1992) to SeaWorld Aurora (22-Oct-1997) to SeaWorld San Antonio (26-Apr-1998) to SeaWorld Orlando (03-Apr-2000) to Busch Gardens Tampa (28-Sep-2000) to SeaWorld Orlando (19-Apr-2001)
4 SeaWorld Orlando to SeaWorld San Diego (< Aug 1986)
5 SeaWorld Orlando to New England Aquarium (22-Feb-1982) to Dolphin Research Center (23-Oct-1991)
6 SeaWorld San Diego to SeaWorld Aurora (< 1987) to SeaWorld San Antonio (13-Oct-1990?)
  currently               region status statusDate COD notes transferDate
1 Marineland Florida      US     Alive  <NA>       NA  NA    <NA>
2 Dolphin Research Center US     Alive  <NA>       NA  NA    <NA>
3 SeaWorld Orlando        US     Alive  <NA>       NA  NA    <NA>
4 SeaWorld San Diego      US     Alive  <NA>       NA  NA    <NA>
5 Dolphin Research Center US     Alive  <NA>       NA  NA    <NA>
6 SeaWorld San Antonio    US     Alive  <NA>       NA  NA    <NA>
  transfer entryDate
1 US       1989-04-07
2 US       1973-11-26
3 US       1978-05-13
4 US       1979-02-03
5 US       1979-08-15
6 US       1980-10-10

In [6]:
cetaceans  %>%  
head(10)

   X1 species
1   1 Bottlenose
2   2 Bottlenose
3   3 Bottlenose
4   4 Bottlenose
5   5 Bottlenose
6   6 Bottlenose
7   7 Bottlenose
8   8 Bottlenose
9   9 Bottlenose
10 10 Bottlenose
   id
1  NOA0004614, AZA 428, MLF-428
2  NOA0004386, AZA 138, IDR-73-1
3  NOA0002137, SWC-TTG-7816
4  NOA0002690, SWF-TT-7903
5  NOA0004418, AZA 242, SWF-TT-7904, MH-82-36-TT (New England Aquarium)
6  NOA0002725, SWC-TT-8014
7  NOA0005036, MH-86-181-TT
8  NOA0002746, SWF-TT-8106
9  NOA0002766, AZA 313, SWC-TT-8228
10 NOA0002784, AZA 334, SWC-TTG-8326
   name     sex accuracy birthYear acquisition originDate
1  Dazzle   F   a        1989      Born        1989-04-07
2  Tursi    F   a        1973      Born        1973-11-26
3  Starbuck M   a        1978      Born        1978-05-13
4  Sandy    F   a        1979      Born        1979-02-03
5  Sandy    M   a        1979      Born        1979-08-15
6  Nacha    F   a        1980      Born        1980-10-10
7  Kama     M   a        1981      Born        1981-03-27
8  Jenever  F   a        1981      Born        1981-10-20
9  Duffy    M   a        1982      Born        1982-10-16
10 Astra    F   a        1983      Born        1983-03-07
   originLocation          ...
1  Marineland Florida      ...
2  Dolphin Research Center ...
3  SeaWorld San Diego      ...
4  SeaWorld Orlando        ...
5  SeaWorld Orlando        ...
6  SeaWorld San Diego      ...
7  SeaWorld San Diego      ...
8  SeaWorld Orlando        ...
9  SeaWorld San Diego      ...
10 SeaWorld San Diego      ...
   transfers
1  NA
2  NA
3  SeaWorld San Diego to SeaWorld Aurora (??-???-1983) to SeaWorld San Diego (??-???-1983) to SeaWorld Aurora (??-???-1985) to SeaWorld San Diego (??-???-1985) to SeaWorld Orlando (< Nov 1987) to SeaWorld San Antonio (< 1991) to Busch Gardens Tampa (1991 / 1992) to National Aquarium in Baltimore (11-Oct-1992) to SeaWorld Aurora (22-Oct-1997) to SeaWorld San Antonio (26-Apr-1998) to SeaWorld Orlando (03-Apr-2000) to Busch Gardens Tampa (28-Sep-2000) to SeaWorld Orlando (19-Apr-2001)
4  SeaWorld Orlando to SeaWorld San Diego (< Aug 1986)
5  SeaWorld Orlando to New England Aquarium (22-Feb-1982) to Dolphin Research Center (23-Oct-1991)
6  SeaWorld San Diego to SeaWorld Aurora (< 1987) to SeaWorld San Antonio (13-Oct-1990?)
7  SeaWorld San Diego to New England Aquarium (22-Oct-1986) to U.S. Navy MMP (17-Nov-1987)
8  SeaWorld Orlando to SeaWorld San Antonio (< 1991) to SeaWorld Orlando (03-Apr-2000)
9  SeaWorld San Diego to SeaWorld Aurora (15-Apr-2000) to SeaWorld Orlando (17-Feb-2001) to Theater of the Sea (28-Jun-2005)
10 SeaWorld San Diego to SeaWorld Aurora (??-???-????) to Unknown History (SeaWorld) to SeaWorld Orlando (??-???-????) to Discovery Cove (~ Feb 2000)
   currently               region status statusDate COD notes transferDate
1  Marineland Florida      US     Alive  <NA>       NA  NA    <NA>
2  Dolphin Research Center US     Alive  <NA>       NA  NA    <NA>
3  SeaWorld Orlando        US     Alive  <NA>       NA  NA    <NA>
4  SeaWorld San Diego      US     Alive  <NA>       NA  NA    <NA>
5  Dolphin Research Center US     Alive  <NA>       NA  NA    <NA>
6  SeaWorld San Antonio    US     Alive  <NA>       NA  NA    <NA>
7  U.S. Navy               US     Alive  <NA>       NA  NA    <NA>
8  SeaWorld Orlando        US     Alive  <NA>       NA  NA    <NA>
9  Theater of the Sea      US     Alive  <NA>       NA  NA    <NA>
10 Discovery Cove          US     Alive  <NA>       NA  NA    <NA>
   transfer entryDate
1  US       1989-04-07
2  US       1973-11-26
3  US       1978-05-13
4  US       1979-02-03
5  US       1979-08-15
6  US       1980-10-10
7  US       1981-03-27
8  US       1981-10-20
9  US       1982-10-16
10 US       1983-03-07

In [7]:
cetaceans  %>% 
glimpse()

Observations: 2,194
Variables: 22
$ X1             <dbl> 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 1...
$ species        <chr> "Bottlenose", "Bottlenose", "Bottlenose", "Bottlenos...
$ id             <chr> "NOA0004614, AZA 428, MLF-428", "NOA0004386, AZA 138...
$ name           <chr> "Dazzle", "Tursi", "Starbuck", "Sandy", "Sandy", "Na...
$ sex            <chr> "F", "F", "M", "F", "M", "F", "M", "F", "M", "F", "M...
$ accuracy       <chr> "a", "a", "a", "a", "a", "a", "a", "a", "a", "a", "a...
$ birthYear      <chr> "1989", "1973", "1978", "1979", "1979", "1980", "198...
$ acquisition    <chr> "Born", "Born", "Born", "Born", "Born", "Born", "Bor...
$ originDate     <date> 1989-04-07, 1973-11-26, 1978-05-13, 1979-02-03, 197...
$ originLocation <chr> "Marineland Florida", "Dolphin Research Center", "Se...
$ mother         <chr> "Betty III", "Little Bit", "Cindy (T.t. gilli)", "Gi...
$ father         <chr> "Davy II", "Mr. Gipper", "Sambo", NA, NA, "Jethro (T...
$ transfers      <chr> NA, NA, "SeaWorld San Diego to SeaWorld Aurora (??-?...
$ currently      <chr> "Marineland Florida", "Dolphin Research Center", "Se...
$ region         <chr> "US", "US", "US", "US", "US", "US", "US", "US", "US"...
$ status         <chr> "Alive", "Alive", "Alive", "Alive", "Alive", "Alive"...
$ statusDate     <date> NA, NA, NA, NA, NA, NA, NA, NA, NA, NA, NA, NA, NA,...
$ COD            <chr> NA, NA, NA, NA, NA, NA, NA, NA, NA, NA, NA, NA, NA, ...
$ notes          <chr> NA, NA, NA, NA, NA, NA, NA, NA, NA, NA, "Sunny was o...
$ transferDate   <date> NA, NA, NA, NA, NA, NA, NA, NA, NA, NA, NA, NA, NA,...
$ transfer       <chr> "US", "US", "US", "US", "US", "US", "US", "US", "US"...
$ entryDate      <date> 1989-04-07, 1973-11-26, 1978-05-13, 1979-02-03, 197...

In [8]:
str(cetaceans)

Classes 'spec_tbl_df', 'tbl_df', 'tbl' and 'data.frame':	2194 obs. of  22 variables:
 $ X1            : num  1 2 3 4 5 6 7 8 9 10 ...
 $ species       : chr  "Bottlenose" "Bottlenose" "Bottlenose" "Bottlenose" ...
 $ id            : chr  "NOA0004614, AZA 428, MLF-428" "NOA0004386, AZA 138, IDR-73-1" "NOA0002137, SWC-TTG-7816" "NOA0002690, SWF-TT-7903" ...
 $ name          : chr  "Dazzle" "Tursi" "Starbuck" "Sandy" ...
 $ sex           : chr  "F" "F" "M" "F" ...
 $ accuracy      : chr  "a" "a" "a" "a" ...
 $ birthYear     : chr  "1989" "1973" "1978" "1979" ...
 $ acquisition   : chr  "Born" "Born" "Born" "Born" ...
 $ originDate    : Date, format: "1989-04-07" "1973-11-26" ...
 $ originLocation: chr  "Marineland Florida" "Dolphin Research Center" "SeaWorld San Diego" "SeaWorld Orlando" ...
 $ mother        : chr  "Betty III" "Little Bit" "Cindy (T.t. gilli)" "Gigi" ...
 $ father        : chr  "Davy II" "Mr. Gipper" "Sambo" NA ...
 $ transfers     : chr  NA NA "SeaWorld San Diego to SeaWorld Aurora (??-???-1983) to SeaWorld San Diego (??-???-1983) to SeaWorld Aurora (??-"| __truncated__ "SeaWorld Orlando to SeaWorld San Diego (< Aug 1986)" ...
 $ currently     : chr  "Marineland Florida" "Dolphin Research Center" "SeaWorld Orlando" "SeaWorld San Diego" ...
 $ region        : chr  "US" "US" "US" "US" ...
 $ status        : chr  "Alive" "Alive" "Alive" "Alive" ...
 $ statusDate    : Date, format: NA NA ...
 $ COD           : chr  NA NA NA NA ...
 $ notes         : chr  NA NA NA NA ...
 $ transferDate  : Date, format: NA NA ...
 $ transfer      : chr  "US" "US" "US" "US" ...
 $ entryDate     : Date, format: "1989-04-07" "1973-11-26" ...
 - attr(*, "spec")=
  .. cols(
  ..   X1 = col_double(),
  ..   species = col_character(),
  ..   id = col_character(),
  ..   name = col_character(),
  ..   sex = col_character(),
  ..   accuracy = col_character(),
  ..   birthYear = col_character(),
  ..   acquisition = col_character(),
  ..   originDate = col_date(format = ""),
  ..   originLocation = col_character(),
  ..   mother = col_character(),
  ..   father = col_character(),
  ..   transfers = col_character(),
  ..   currently = col_character(),
  ..   region = col_character(),
  ..   status = col_character(),
  ..   statusDate = col_date(format = ""),
  ..   COD = col_character(),
  ..   notes = col_character(),
  ..   transferDate = col_date(format = ""),
  ..   transfer = col_character(),
  ..   entryDate = col_date(format = "")
  .. )

## separate - separate one column into several

In [9]:
# The separate function is telling R to seperate the “originDate” column into “originYear”,“originMonth”, and “originDay”.
# remove = TRUE deletes the original column, but remove = FALSE retains it.
cetaceans  %>% 
    separate(originDate, into=c('originYear','originMonth','originDay'),
            sep='-', remove=FALSE)  %>% 
    select(originDate, originYear, originMonth, originDay)  %>% 
    head(10)

   originDate originYear originMonth originDay
1  1989-04-07 1989       04          07
2  1973-11-26 1973       11          26
3  1978-05-13 1978       05          13
4  1979-02-03 1979       02          03
5  1979-08-15 1979       08          15
6  1980-10-10 1980       10          10
7  1981-03-27 1981       03          27
8  1981-10-20 1981       10          20
9  1982-10-16 1982       10          16
10 1983-03-07 1983       03          07

gather - gather columns into rows (make a long dataset)

supplementary info
https://blog.csdn.net/six66667/article/details/84888644

In [10]:
install.packages('tidyr')
library(tidyr)

Warning message:
"package 'tidyr' is in use and will not be installed"

In [13]:
# gather() 
stu<-data.frame(grade=c("A","B","C","D","E"), 
                female=c(5, 4, 1, 2, 3),
                male=c(1, 2, 3, 4, 5))
stu

  grade female male
1 A     5      1
2 B     4      2
3 C     1      3
4 D     2      4
5 E     3      5

In [17]:
gather(stu, gender, count, -grade)

   grade gender count
1  A     female 5
2  B     female 4
3  C     female 1
4  D     female 2
5  E     female 3
6  A     male   1
7  B     male   2
8  C     male   3
9  D     male   4
10 E     male   5

In [18]:
# separate() 
# separate负责分割数据，把一个变量中就包含两个变量的数据分来
stu2<-data.frame(grade=c("A","B","C","D","E"), 
                 female_1=c(5, 4, 1, 2, 3), 
                 male_1=c(1, 2, 3, 4, 5),
                 female_2=c(4, 5, 1, 2, 3), 
                 male_2=c(0, 2, 3, 4, 6))

stu2

  grade female_1 male_1 female_2 male_2
1 A     5        1      4        0
2 B     4        2      5        2
3 C     1        3      1        3
4 D     2        4      2        4
5 E     3        5      3        6

In [20]:
stu2_new<-gather(stu2,gender_class,count,-grade)

stu2_new

   grade gender_class count
1  A     female_1     5
2  B     female_1     4
3  C     female_1     1
4  D     female_1     2
5  E     female_1     3
6  A     male_1       1
7  B     male_1       2
8  C     male_1       3
9  D     male_1       4
10 E     male_1       5
11 A     female_2     4
12 B     female_2     5
13 C     female_2     1
14 D     female_2     2
15 E     female_2     3
16 A     male_2       0
17 B     male_2       2
18 C     male_2       3
19 D     male_2       4
20 E     male_2       6

In [21]:
separate(stu2_new,
         gender_class,c("gender","class"))

   grade gender class count
1  A     female 1     5
2  B     female 1     4
3  C     female 1     1
4  D     female 1     2
5  E     female 1     3
6  A     male   1     1
7  B     male   1     2
8  C     male   1     3
9  D     male   1     4
10 E     male   1     5
11 A     female 2     4
12 B     female 2     5
13 C     female 2     1
14 D     female 2     2
15 E     female 2     3
16 A     male   2     0
17 B     male   2     2
18 C     male   2     3
19 D     male   2     4
20 E     male   2     6

In [22]:
# spread

name<-rep(c("Sally","Jeff","Roger","Karen","Brain"),c(2,2,2,2,2))
test<-rep(c("midterm","final"),5)
class1<-c("A","C",NA,NA,NA,NA,NA,NA,"B","B")
class2<-c(NA,NA,"D","E","C","A",NA,NA,NA,NA)
class3<-c("B","C",NA,NA,NA,NA,"C","C",NA,NA)
class4<-c(NA,NA,"A","C",NA,NA,"A","A",NA,NA)
class5<-c(NA,NA,NA,NA,"B","A",NA,NA,"A","C")
stu3<-data.frame(name,test,class1,class2,class3,class4,class5)

stu3

   name  test    class1 class2 class3 class4 class5
1  Sally midterm A      NA     B      NA     NA
2  Sally final   C      NA     C      NA     NA
3  Jeff  midterm NA     D      NA     A      NA
4  Jeff  final   NA     E      NA     C      NA
5  Roger midterm NA     C      NA     NA     B
6  Roger final   NA     A      NA     NA     A
7  Karen midterm NA     NA     C      A      NA
8  Karen final   NA     NA     C      A      NA
9  Brain midterm B      NA     NA     NA     A
10 Brain final   B      NA     NA     NA     C

In [24]:
# na.rm=TRUE参数，自动去除有缺失值的记录（一条记录就是一行）：
gather(stu3, class, grade, class1:class5, na.rm=TRUE)

Your code contains a unicode char which cannot be displayed in your
current locale and R will silently convert it to an escaped form when the
R kernel executes this code. This can lead to subtle errors if you use
such chars to do comparisons. For more information, please see
https://github.com/IRkernel/repr/wiki/Problems-with-unicode-on-windowsWarning message:
"attributes are not identical across measure variables;
they will be dropped"

   name  test    class  grade
1  Sally midterm class1 A
2  Sally final   class1 C
9  Brain midterm class1 B
10 Brain final   class1 B
13 Jeff  midterm class2 D
14 Jeff  final   class2 E
15 Roger midterm class2 C
16 Roger final   class2 A
21 Sally midterm class3 B
22 Sally final   class3 C
27 Karen midterm class3 C
28 Karen final   class3 C
33 Jeff  midterm class4 A
34 Jeff  final   class4 C
37 Karen midterm class4 A
38 Karen final   class4 A
45 Roger midterm class5 B
46 Roger final   class5 A
49 Brain midterm class5 A
50 Brain final   class5 C